using UnityEngine;
using UnityEngine.UIElements;

public class MutableObject : MonoBehaviour
{

// У каждого нового куба Scale уменьшен в два раза по всем осям относительно того куба, на который нажал пользователь.
// Цвет каждого куба определяется случайным образом.
// На каждый куб действует сила гравитации.

//Добавить взрывную силу из центра исчезнувшего куба, которая разбросает только созданные им объекты.
//Сделать невидимые ограждения, чтобы кубики далеко не разлетались

 
     void Start()
    {
        
    }

    // Update is called once per frame
    void Update()
    {
        
    }
}
